{
  "kind": "build_request",
  "title": "Fix password gate to accept 9102008 and update password hint text",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the password gate so the correct password is exactly \"9102008\" (instead of the currently coded value), and ensure entering \"9102008\" unlocks the Valentine page content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "What was the password?",
          "The password you set for the page is 9102008.",
          "It's showing me that it's incorrect"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/App.tsx, the password check uses the exact string \"9102008\" as the correct password.",
        "When the user enters \"9102008\" in the password screen and submits, the app unlocks and shows the main Valentine page content.",
        "When the user enters any other password, the app remains locked and shows the existing error message."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update the password screen hint text to exactly: \"Hint: The most happiest day for me.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yeas and also in the Hint you should write The most happiest day for me."
        ]
      },
      "acceptanceCriteria": [
        "On the password gate screen (frontend/src/components/PasswordGateView.tsx), the hint line displays exactly: \"Hint: The most happiest day for me.\"",
        "No other user-facing text is changed as part of this update."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not change the existing unlock persistence mechanism (sessionStorage key valentine_unlocked) other than what is required to update the password and hint text.",
    "No backend changes (Motoko) are required for this request."
  ],
  "nonGoals": [
    "Do not add new authentication methods (e.g., Internet Identity) for this password gate.",
    "Do not redesign the Valentine page layout, animations, or images beyond the specified text/password changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}